import React from "react";
import "./styles.scss";

const AgreementText = () => {
  return (
    <div className="agreement-text">
      <h2 className="agreement-title">
        Условия и положения пользования мобильным приложением «abook»
      </h2>
      <p className="agreement-info">
        Настоящие Условия и Положения представляют собой соглашение между вами и
        компанией NOVDA Edutainment (далее — «Соглашение»). Внимательно прочтите
        Соглашение. Если вы понимаете и принимаете условия настоящего
        Соглашения, нажмите кнопку «Принимаю». <br />
        <br />
      </p>

      <h2 className="agreement-title">A. ОСНОВНЫЕ СВЕДЕНИЯ О НАШИХ УСЛУГАХ</h2>
      <p className="agreement-info">
        Настоящее Соглашение регулирует пользование вами услуг (далее —
        «Услуги») компании NOVDA Edutainment, посредством которых вы можете
        приобрести, получить, лицензировать, арендовать или оформить подписку на
        содержимое, приложения (далее — «Приложения») и другие услуги (далее —
        «Содержимое»). Содержимое может предлагаться через Услуги NOVDA
        Edutainment или сторонних организаций. Наши Услуги доступны для
        пользования в вашей стране проживания (далее — «Страна проживания»).
        Чтобы использовать наши Услуги, вам потребуется совместимое
        оборудование, программное обеспечение (рекомендуется и иногда необходимо
        использовать последнюю версию) и доступ к Интернету (может взиматься
        плата). Вышеперечисленные факторы могут влиять на качество работы наших
        Услуг.
        <br />
        <br />
      </p>

      <h2 className="agreement-title">B. ПОЛЬЗОВАНИЕ НАШИМИ УСЛУГАМИ</h2>
      <h3 className="agreement-subtitle">ПЛАТЕЖИ, НАЛОГИ И ВОЗМЕЩЕНИЯ</h3>
      <p className="agreement-info">
        Вы можете приобрести Содержимое в рамках наших Услуг бесплатно или за
        определенную плату, что в любом из случаев будет считаться
        «Транзакцией». Любая Транзакция — это электронное соглашение между вами
        и компанией NOVDA Edutainment и/или вами и юридическим лицом,
        предоставляющим Содержимое в рамках наших Услуг. Если вы клиент компании
        NOVDA Edutainment покупаете книгу, официальным продавцом выступает
        компания NOVDA Edutainment. Это означает, что вы покупаете Содержимое у
        компании NOVDA Edutainment и оно лицензируется Поставщиком Приложения
        (согласно определению ниже) или издателем книги. При совершении первой
        Транзакции вам будет предложено выбрать частоту запросов вашего пароля
        для будущих Транзакций. Если вы активируете Touch ID для Транзакций, вы
        будете получать запрос на подтверждение всех Транзакций с помощью
        отпечатка пальца, а если вы активируете Face ID для Транзакций, вы
        будете получать запрос на подтверждение всех Транзакций с помощью снимка
        лица. Настройки пароля можно задать в любое время, следуя инструкциям в
        статье: https://указать_сайт . Компания NOVDA Edutainment будет
        использовать выбранный вами способ оплаты (например, кредитной картой,
        дебетовой картой картой или кодом либо другой способ, доступный в вашей
        Стране проживания) для любых платных Транзакций с учетом применимых
        налогов. Если не удается произвести оплату с помощью выбранного вами
        способа оплаты (например, срок действия карты истек или на ней
        недостаточно средств), вы несете ответственность за погашение всех
        задолженностей. Если вы измените способ оплаты, мы снова попытаемся
        погасить задолженность с нового способа оплаты. В случае предзаказа
        Содержимого с вас будет удержана плата после его получения (кроме
        случаев отмены заказа до того, как Содержимое станет доступно). В
        соответствии с местным законодательcтвом NOVDA Edutainment может
        обновлять информацию, которая касается выбранного вами способа оплаты,
        если данная информация предоставляется вашим финансовым учреждением.
        Подробные сведения о выставлении счетов за Транзакции см. на странице
        https://support.указать_сайт . Все Транзакции носят окончательный
        характер. Цены на Содержимое могут быть изменены в любое время. Если
        получение Содержимого невозможно или необоснованно задерживается по
        причине технических проблем, ваше единственное средство правовой защиты
        — это замена Содержимого либо возмещение уплаченной цены в порядке,
        установленном компанией NOVDA Edutainment. В определенных случаях
        компания NOVDA Edutainment может отказать в возмещении средств при
        обнаружении признаков мошенничества, злоупотребления возмещениями или
        иного манипуляционного поведения, которое дает компании NOVDA
        Edutainment право на предъявление встречных претензий.
        <br />
        <br />
      </p>
      <h2 className="agreement-title">КОНФИДЕНЦИАЛЬНОСТЬ</h2>
      <p className="agreement-info">
        На использование вами наших Услуг распространяется Политика
        конфиденциальности NOVDA Edutainment, доступная на странице
        https://www.apple.com/legal/privacy/.
        <br />
        <br />
      </p>
      <h2 className="agreement-title">
        ПРАВИЛА ПОЛЬЗОВАНИЯ УСЛУГАМИ И СОДЕРЖИМЫМ
      </h2>
      <p className="agreement-info">
        При пользовании Услугами и Содержимым вы должны соблюдать правила,
        изложенные в настоящем разделе (далее — «Правила пользования»).
        Использование Услуг и Содержимого любым иным образом является
        существенным нарушением настоящего Соглашения. Компания NOVDA
        Edutainment может отслеживать использование вами Услуг и Содержимого,
        чтобы проконтролировать соблюдение настоящих Правил пользования.
        <br />
        <br />
      </p>
      <h2 className="agreement-title">Все Услуги</h2>
      <p className="agreement-info">
        — Вы можете использовать Услуги и Содержимое только в личных
        некоммерческих целях (кроме случаев, указанных в разделе «Содержимое App
        Store» ниже). <br />
        — Предоставление Содержимого компанией NOVDA Edutainment не
        подразумевает передачу вам каких-либо прав на использование в
        коммерческих или рекламных целях и не является передачей прав или
        отказом от них со стороны обладателей авторских прав.
        <br />
        — Вы можете использовать Содержимое с помощью разных (до 5)
        идентификаторов на каждом устройстве.
        <br />
        — Вы несете ответственность за недопущение утери, уничтожения и
        повреждения Содержимого после его загрузки. Мы рекомендуем вам регулярно
        создавать резервные копии Содержимого. <br />
        — Вы не имеете права изменять или обходить технологии безопасности,
        поставляемые вместе с Услугами.
        <br />
        — Вы можете осуществлять доступ к Услугам только с использованием ПО
        компании NOVDA Edutainment и не имеете права модифицировать его или
        использовать модифицированные версии такого ПО.
        <br />
      </p>
      <h2 className="agreement-title">Содержимое App Store и Google Play</h2>
      <p className="agreement-info">
        — Термин «Приложение» включает приложения для любой платформы NOVDA
        Edutainment, встроенные покупки, расширения (например, клавиатуры),
        наклейки и подписки, доступные в приложении. <br />
        — Вы можете использовать Приложения на любом устройстве, которым вы
        владеете или управляете. <br />
        — Лица, действующие от имени коммерческого предприятия, государственной
        организации или образовательного учреждения (далее — «Предприятие»),
        могут загружать и синхронизировать Приложения для использования (i)
        одним лицом на одном или более устройствах в собственности или под
        управлением Предприятия либо (ii) несколькими лицами на одном общем
        устройстве в собственности или под управлением Предприятия. Для ясности,
        каждое устройство, используемое последовательно или совместно
        несколькими пользователями, требует отдельной лицензии. <br />
      </p>
      <h2 className="agreement-title">ПОВТОРНЫЕ ЗАГРУЗКИ</h2>
      <p className="agreement-info">
        У вас может быть возможность повторно загрузить ранее приобретенное
        Содержимое (далее — «Повторная загрузка») на устройства, на которых
        выполнен вход с помощью одного и того же идентификатора ID (далее —
        «Связанные устройства»). Типы Содержимого, доступные для Повторной
        загрузки в вашей Стране проживания, см. на странице
        https://support.apple.com/ru-ru/HT204632 (указать сайт). Содержимое
        может быть недоступно для Повторной загрузки, если оно больше не
        предлагается в рамках наших Услуг. <br />
        Правила Связанных устройств: вы можете выполнить вход с помощью своего
        идентификатора ID одновременно максимум на 10 устройствах (из них не
        более 5 компьютеров). Каждый компьютер должен быть также авторизован с
        помощью одного и того же идентификатора ID (дополнительные сведения об
        авторизации компьютеров см. на странице
        https://support.apple.com/ru-ru/HT201251). Устройства можно связывать с
        разными идентификаторами ID один раз каждые 90 дней.
      </p>
      <h2 className="agreement-title">ПОДПИСКИ</h2>
      <p className="agreement-info">
        Услуги и определенные Приложения могут давать вам право приобрести
        доступ к Содержимому и услугам посредством подписки (далее — «Платные
        подписки»). Платные подписки автоматически продлеваются, пока эта
        функция не будет отменена в разделе «Управление подписками» настроек
        вашей учетной записи. Более подробно об отмене подписки можно узнать на
        сайте https://support.apple.com/en-us/HT202039 (указать сайт). Мы
        сообщим вам, если стоимость Платной подписки повысится, и при
        необходимости запросим ваше согласие на ее продление. С вас будет
        удержана плата не ранее чем за 24 часа до начала очередного срока
        Платной подписки. Если мы по какой-либо причине (например, из-за
        истечения срока действия или недостатка средств) не сможем получить
        оплату согласно вашему способу оплаты, а вы не отмените Платную
        подписку, вы несете ответственность за все неполученные нами суммы. Мы
        попытаемся использовать способ оплаты, когда вы обновите информацию о
        способе оплаты. Это может привести к изменениям в начале вашего
        следующего срока Платной подписки и изменить дату выставления счетов за
        каждый срок. Мы оставляем за собой право отменить вашу Платную подписку,
        если мы не сможем успешно снять плату за продление подписки через
        указанный вами способ оплаты. Прежде чем с вас будет списана сумма
        согласно вашему способу оплаты, для некоторых Платных подписок может
        быть предложен бесплатный пробный период. Если вы решили отказаться от
        Платной подписки до того, как с вас будет удержана плата, отмените
        подписку не позднее чем за 24 часа до окончания бесплатного пробного
        периода.
        <br />
      </p>
      <h2 className="agreement-title">ДОСТУПНОСТЬ СОДЕРЖИМОГО И УСЛУГ</h2>
      <p className="agreement-info">
        Условия настоящего Соглашения, относящиеся к Услугам, типам Содержимого,
        функциям и возможностям, недоступным в вашей Стране проживания,
        неприменимы к вам до тех пор, пока вышеперечисленное не станет доступным
        для вас. Чтобы просмотреть типы Содержимого, доступные в вашей Стране
        проживания, перейдите к Услугам или посетите страницу
        https://support.apple.com/ru-ru/HT204411 (указать сайт). Некоторые
        Услуги и Содержимое, доступные вам в вашей Стране, могут быть недоступны
        при поездках за границу.
        <br />
      </p>
      <h2 className="agreement-title">
        C. ВАШИ ПУБЛИКАЦИИ В РАМКАХ НАШИХ УСЛУГ
      </h2>
      <p className="agreement-info">
        Наши Услуги могут предоставлять вам право публиковать такие материалы,
        как комментарии, изображения, видеоролики и подкасты (включая связанные
        метаданные и обложки). При пользовании этими функциями вы должны
        соблюдать Инструкции по публикациям, которые могут периодически
        обновляться. Если вы столкнулись с материалами, которые не отвечают
        требованиям Инструкций по публикациям, воспользуйтесь функцией
        «Отправить жалобу». Настоящим вы предоставляете компании NOVDA
        Edutainment глобальную, безвозмездную, неограниченную, неисключительную
        лицензию на использование материалов, публикуемых вами в рамках Услуг и
        сопутствующий маркетинг. Компания NOVDA Edutainment может отслеживать
        любые опубликованные материалы и принимать решение по их удалению или
        изменению.
        <br />
      </p>
      <h3 className="agreement-subtitle">
        Инструкции по публикациям: вы не имеете права использовать Услуги,
        чтобы:
      </h3>
      <p className="agreement-info">
        — публиковать материалы, на использование которых у вас нет разрешений,
        прав или лицензии;
        <br />
        — публиковать предосудительное, оскорбительное, запрещенное законом,
        ложное или вредное содержимое;
        <br />
        — публиковать личную, частную или конфиденциальную информацию,
        принадлежащую другим лицам;
        <br />
        — запрашивать личную информацию у несовершеннолетних лиц;
        <br />
        — выдавать себя за другого человека или юридическое лицо либо искажать
        вашу взаимосвязь с другими лицами;
        <br />
        — публиковать и передавать спам, в том числе, помимо прочего,
        нежелательную или несанкционированную рекламу, рекламные материалы или
        информационные объявления;
        <br />
        — планировать какую-либо незаконную, мошенническую и манипуляционную
        деятельность и участвовать в ней.
        <br />
      </p>
      <h2 className="agreement-title">
        E. ПЕРСОНАЛИЗИРОВАННЫЕ РЕКОМЕНДАТЕЛЬНЫЕ ФУНКЦИИ
      </h2>
      <p className="agreement-info">
        При пользовании Услугами вы можете получать рекомендации по Содержимому,
        основанные на ваших загрузках, покупках и других действиях. Некоторые
        Услуги позволяют вам отказаться от получения таких персонализированных
        рекомендаций в настройках учетной записи. <br />
        <br />
        Для включения некоторых рекомендательных функций требуется ваше
        разрешение. При включении этих функций вам будет предложено предоставить
        компании NOVDA Edutainment разрешение на сбор и сохранение некоторых
        данных, в том числе, помимо прочего, данных об активности,
        местонахождении и использовании вашего устройства. Внимательно
        прочитайте информацию, предоставляемую вам при включении этих функций.
        <br />
      </p>
      <h2 className="agreement-title">ОБСЛУЖИВАНИЕ И ПОДДЕРЖКА ПРИЛОЖЕНИЙ</h2>
      <p className="agreement-info">
        Компания NOVDA Edutainment несет ответственность за предоставление
        технического обслуживания и поддержки только для Приложения NOVDA
        Edutainment либо в соответствии с применимым законодательством.
        Поставщики приложений несут ответственность за предоставление
        обслуживания и поддержки для Приложений сторонних разработчиков. <br />
      </p>
      <h2 className="agreement-title">ПАКЕТЫ ПРИЛОЖЕНИЙ</h2>
      <p className="agreement-info">
        Некоторые Приложения могут предоставляться вместе в виде пакета (далее —
        «Пакет Приложений). Стоимость Пакета Приложений — это количество
        средств, которое нужно заплатить при его покупке. Она может быть
        снижена, если вы уже приобрели или получили часть Приложений, но может
        включать минимальный тариф для Пакета Приложений.
        <br />
      </p>
      <h2 className="agreement-title">
        ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ С КОНЕЧНЫМ ПОЛЬЗОВАТЕЛЕМ ЛИЦЕНЗИРОВАННОГО
        ПРИЛОЖЕНИЯ
      </h2>
      <p className="agreement-info">
        Приложения, доступные через магазин App Store и Google Play,
        предоставляются по лицензии, а не продаются. До получения лицензии на
        каждое Приложение необходимо принять условия настоящего Лицензионного
        соглашения с конечным пользователем лицензированного приложения (далее —
        «Стандартное ЛСКП») или отдельного лицензионного соглашения с конечным
        пользователем между вами и Поставщиком Приложения (далее —
        «Пользовательское ЛСКП»), если таковое предусмотрено. По условиям
        настоящего Стандартного ЛСКП или Пользовательского ЛСКП лицензия на
        какое-либо Приложение компании NOVDA Edutainment предоставляется
        компанией NOVDA Edutainment, а лицензия на какое-либо Приложение Третьих
        лиц по условиям настоящего Стандартного ЛСКП или Пользовательского ЛСКП
        предоставляется Поставщиком данного Приложения Третьих лиц. Любое
        Приложение, на которое распространяются условия настоящего Стандартного
        ЛСКП, в данном соглашении именуется «Лицензированное приложение».
        Поставщик Приложения или, в зависимости от конкретного случая, компания
        NOVDA Edutainment (далее — «Лицензиар») оставляет за собой все права на
        Лицензированное приложение, кроме прямо предоставленных вам по условиям
        настоящего Стандартного ЛСКП.
        <br />
        <br />
        <strong>a.</strong> Объем прав, предоставляемых по Лицензии. Лицензиар
        предоставляет вам не подлежащую передаче лицензию на использование
        Лицензированного приложения устройстве, находящемся в вашем владении или
        распоряжении, в соответствии с Правилами пользования. Условия настоящего
        Стандартного ЛСКП распространяются на все ресурсы, материалы или услуги,
        доступные или приобретенные в рамках Лицензированного приложения, а
        также на новые версии, предоставляемые Лицензиаром, которые заменяют или
        дополняют оригинальное Лицензированное приложение, если такое обновление
        не регламентируется условиями Пользовательского ЛСКП. За исключением
        случаев, предусмотренных в Правилах пользования, вы не можете
        распространять Лицензированное приложение или предоставлять доступ к
        нему через сеть, где оно может одновременно использоваться на нескольких
        устройствах. Вы не можете передавать, распространять Лицензированное
        приложение или предоставлять на него сублицензию. В случае продажи
        устройства третьему лицу вам необходимо удалить Лицензированное
        приложение с устройства перед продажей. Не допускается копирование
        (кроме случаев, прямо предусмотренных настоящей лицензией и Правилами
        пользования), вскрытие технологии, обратное проектирование и
        дизассемблирование, попытка извлечения исходного кода, изменение или
        создание производных продуктов на основе Лицензированного приложения,
        новых версий Лицензированного приложения или его частей (кроме случаев,
        когда данные ограничения запрещены применимым законодательством, и в
        пределах, в которых они запрещены, либо в объеме, разрешенном условиями
        лицензирования, регулирующими использование любых входящих в состав
        Лицензированного приложения компонентов с открытым исходным кодом).
        <br />
        <strong>b.</strong> Предоставляя согласие на использование данных, вы
        соглашаетесь, что Лицензиар может собирать и использовать технические
        данные и сопутствующую информацию, включая, но не ограничиваясь этим,
        техническую информацию о вашем устройстве, программном обеспечении
        операционной системы и приложений, а также о периферийных устройствах.
        Эта информация собирается на регулярной основе, чтобы упростить
        предоставление обновлений программного обеспечения, поддержки
        программных продуктов и других возможных услуг в связи с Лицензированным
        приложением. Лицензиар может использовать такую информацию с целью
        усовершенствования продукции или предоставления вам услуг или технологий
        при условии, что форма такой информации не позволяет идентифицировать
        вас лично.
        <br />
        <strong>c.</strong> Прекращение действия лицензии. Настоящее Стандартное
        ЛСКП остается в силе до тех пор, пока оно не будет расторгнуто вами или
        Лицензиаром. В случае невыполнения вами какого-либо из условий
        настоящего Стандартного ЛСКП ваши права по нему автоматически
        прекращаются. <br />
        <strong>d.</strong> Внешние службы. Лицензированное приложение может
        предоставлять доступ к службам и веб-сайтам Лицензиара и (или) третьих
        лиц (далее в совокупности и по отдельности — «Внешние службы»). Вы
        соглашаетесь использовать Внешние службы на свой страх и риск. Лицензиар
        не несет ответственности за проверку или оценку материала или за
        точность каких-либо Внешних служб третьих лиц, а также не несет
        ответственности за любые подобные Внешние службы третьих лиц. Данные,
        отображаемые каким-либо Лицензированным приложением или Внешними
        службами, включая, помимо прочего, финансовые, медицинские данные,
        информацию о местонахождении, предоставляются только для общей
        информации, и ни Лицензиар, ни его агенты не гарантируют их точность и
        достоверность. Вы обязуетесь не использовать Внешние службы каким-либо
        образом, нарушающим условия настоящего Стандартного ЛСКП, а также права
        интеллектуальной собственности Лицензиара или третьих лиц. Вы
        соглашаетесь не допускать использования Внешних служб в целях
        домогательства, оскорбления, преследования, угроз или дискредитации
        каких-либо физических или юридических лиц, а также соглашаетесь с тем,
        что Лицензиар не несет ответственности за их использование в подобных
        целях. Внешние службы могут быть недоступны на всех языках или в вашей
        стране и могут быть неприемлемыми или недоступными для использования в
        какой-либо конкретной географической точке. Используя такие Внешние
        службы, вы несете единоличную ответственность за соблюдение всех
        применимых законов. Лицензиар оставляет за собой право в любое время без
        предварительного уведомления или наступления ответственности перед вами
        изменять, приостанавливать, удалять, отключать какие-либо Внешние службы
        или ограничивать доступ к ним. <br />
        <strong>e.</strong> ОТСУТСТВИЕ ГАРАНТИИ. ВЫ ПРЯМЫМ ОБРАЗОМ ПОДТВЕРЖДАЕТЕ
        И СОГЛАШАЕТЕСЬ, ЧТО ИСПОЛЬЗУЕТЕ ЛИЦЕНЗИРОВАННОЕ ПРИЛОЖЕНИЕ ИСКЛЮЧИТЕЛЬНО
        НА СВОЙ СТРАХ И РИСК. В МАКСИМАЛЬНО ДОПУСТИМОЙ ПРИМЕНИМЫМ
        ЗАКОНОДАТЕЛЬСТВОМ СТЕПЕНИ ЛИЦЕНЗИРОВАННОЕ ПРИЛОЖЕНИЕ И ВСЕ УСЛУГИ,
        ПОДДЕРЖИВАЕМЫЕ ИЛИ ПРЕДОСТАВЛЯЕМЫЕ ЛИЦЕНЗИРОВАННЫМ ПРИЛОЖЕНИЕМ,
        ПРЕДОСТАВЛЯЮТСЯ НА УСЛОВИЯХ «КАК ЕСТЬ» И «ПРИ НАЛИЧИИ» БЕЗ ГАРАНТИЙ
        ОТСУТСТВИЯ НЕДОСТАТКОВ И БЕЗ ИНЫХ ГАРАНТИЙ, И В ОТНОШЕНИИ
        ЛИЦЕНЗИРОВАННОГО ПРИЛОЖЕНИЯ И УСЛУГ ЛИЦЕНЗИАР НАСТОЯЩИМ ОТКАЗЫВАЕТСЯ ОТ
        ПРЕДОСТАВЛЕНИЯ ГАРАНТИЙ И УСЛОВИЙ, ПРЯМЫХ, ПОДРАЗУМЕВАЕМЫХ И
        УСТАНОВЛЕННЫХ ЗАКОНОМ, ВКЛЮЧАЯ, ПОМИМО ПРОЧЕГО, ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ
        И (ИЛИ) УСЛОВИЯ ТОВАРНОГО СОСТОЯНИЯ, УДОВЛЕТВОРИТЕЛЬНОГО КАЧЕСТВА,
        ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННЫХ ЦЕЛЕЙ, ТОЧНОСТИ, БЕСПРЕПЯТСТВЕННОГО
        ПОЛЬЗОВАНИЯ И НЕНАРУШЕНИЯ ПРАВ ТРЕТЬИХ ЛИЦ. НИКАКИЕ УСТНЫЕ ИЛИ
        ПИСЬМЕННЫЕ СВЕДЕНИЯ ИЛИ СОВЕТЫ СО СТОРОНЫ ЛИЦЕНЗИАРА ИЛИ ЕГО
        УПОЛНОМОЧЕННЫХ ПРЕДСТАВИТЕЛЕЙ НЕ ПРЕДСТАВЛЯЮТ СОБОЙ ГАРАНТИЮ. ЕСЛИ
        ЛИЦЕНЗИРОВАННОЕ ПРИЛОЖЕНИЕ ИЛИ УСЛУГИ ОКАЖУТСЯ ДЕФЕКТНЫМИ, ВЫ
        ОПЛАЧИВАЕТЕ ВСЮ СТОИМОСТЬ НЕОБХОДИМОГО ОБСЛУЖИВАНИЯ, РЕМОНТА ИЛИ
        ИСПРАВЛЕНИЙ. В НЕКОТОРЫХ ЮРИСДИКЦИЯХ НЕ ДОПУСКАЕТСЯ ИСКЛЮЧЕНИЕ
        ПОДРАЗУМЕВАЕМЫХ ГАРАНТИЙ ИЛИ ОГРАНИЧЕНИЕ СООТВЕТСТВУЮЩИХ ЗАКОННЫХ ПРАВ
        ПОТРЕБИТЕЛЯ, В СВЯЗИ С ЧЕМ НАЗВАННЫЕ ВЫШЕ ИСКЛЮЧЕНИЕ И ОГРАНИЧЕНИЯ МОГУТ
        НЕ РАСПРОСТРАНЯТЬСЯ НА ВАС.
        <br />
        <strong>f.</strong> Ограничение ответственности. В НЕ ЗАПРЕЩЕННОЙ
        ЗАКОНОМ СТЕПЕНИ ЛИЦЕНЗИАР НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ НЕ НЕСЕТ
        ОТВЕТСТВЕННОСТИ ЗА ПРИЧИНЕНИЕ ВРЕДА ЗДОРОВЬЮ И ОТВЕТСТВЕННОСТИ ПО
        ВОЗМЕЩЕНИЮ СЛУЧАЙНЫХ, ФАКТИЧЕСКИХ, НЕПРЯМЫХ ИЛИ КОСВЕННЫХ УБЫТКОВ ЛЮБОГО
        РОДА, ВКЛЮЧАЯ, ПОМИМО ПРОЧЕГО, ВОЗМЕЩЕНИЕ УПУЩЕННОЙ ВЫГОДЫ, УТЕРИ
        ДАННЫХ, ПРЕРЫВАНИЯ ХОЗЯЙСТВЕННОЙ ДЕЯТЕЛЬНОСТИ, А ТАКЖЕ ЛЮБЫХ ИНЫХ
        КОММЕРЧЕСКИХ ПОТЕРЬ И УБЫТКОВ В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ИЛИ
        НЕВОЗМОЖНОСТЬЮ ИСПОЛЬЗОВАНИЯ ВАМИ ЛИЦЕНЗИРОВАННОГО ПРИЛОЖЕНИЯ ВНЕ
        ЗАВИСИМОСТИ ОТ ТЕОРИИ НАСТУПЛЕНИЯ ОТВЕТСТВЕННОСТИ (В СИЛУ ДОГОВОРА,
        ДЕЛИКТА ИЛИ ИНЫМ ОБРАЗОМ), ДАЖЕ ЕСЛИ ЛИЦЕНЗИАР БЫЛ УВЕДОМЛЕН О
        ВОЗМОЖНОСТИ ВОЗНИКНОВЕНИЯ ТАКИХ УБЫТКОВ. В НЕКОТОРЫХ ЮРИСДИКЦИЯХ НЕ
        ДОПУСКАЕТСЯ ОГРАНИЧЕНИЕ ОТВЕТСТВЕННОСТИ ЗА ПРИЧИНЕНИЕ ВРЕДА ЗДОРОВЬЮ,
        СЛУЧАЙНЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ, ПОЭТОМУ ДАННОЕ ОГРАНИЧЕНИЕ МОЖЕТ НЕ
        РАСПРОСТРАНЯТЬСЯ НА ВАС. Полная ответственность Лицензиара перед вами за
        все убытки (кроме требуемой применимым законодательством в случае
        причинения вреда здоровью) ни при каких обстоятельствах не будет
        превышать сумму в размере 50 (пятидесяти) долларов УЗБЕКИСТАНА00 центов.
        Вышеуказанные ограничения применяются, даже если осуществление
        предусмотренного выше средства правовой защиты не достигло своей
        основной цели.
        <br />
        <strong>g.</strong> Лицензированное приложение и сопутствующая
        документация являются «Коммерческими продуктами» в контексте нормативных
        актов органов исполнительной власти УЗБЕКИСТАНА и состоят из
        «Коммерческого компьютерного программного обеспечения» и «Документации
        на коммерческое компьютерное программное обеспечение» в контексте
        §12.212 главы 48 или §227.7202 главы 48 Свода нормативных актов
        федеральных органов исполнительной власти УЗБЕКИСТАНА соответственно.
        Согласно §12.212 главы 48 или §§227.7202–1 по 227.7202–4 главы 48 Свода
        нормативных актов федеральных органов исполнительной власти УЗБЕКИСТАНА
        соответственно, лицензии на Коммерческое компьютерное программное
        обеспечение и на Документацию на коммерческое компьютерное программное
        обеспечение предоставляются конечным пользователям из Правительства
        Узбекистана: (a) только как на коммерческие продукты и (b) только с
        объемом прав, предоставляемых всем остальным конечным пользователям в
        соответствии с условиями настоящего документа. Права на неопубликованные
        материалы защищены законодательством УЗБЕКИСТАНА об авторском праве.
        <br />
        <strong>i.</strong> Кроме случаев, специально оговоренных в следующем
        абзаце, настоящее Соглашение и отношения между вами и компанией NOVDA
        Edutainment должны регулироваться законами Республики Узбекистан, за
        исключением его положений коллизионного права. Вы и компания NOVDA
        Edutainment соглашаетесь подчиняться персональной и исключительной
        юрисдикции судов, находящихся на территории Республики Узбекистан, для
        разрешения каких-либо споров или претензий, вытекающих из настоящего
        Соглашения. Если вы (a) не являетесь гражданином Республики Узбекистан,
        (b) не проживаете в Республике Узбекистан, (c) не осуществляете доступ к
        Услуге из Республики Узбекистан и (d) являетесь гражданином одной из
        стран, указанных ниже, вы тем самым соглашаетесь, что любой спор или
        претензия, вытекающие из настоящего Соглашения, регулируются действующим
        законодательством, изложенным ниже, без учета каких-либо положений
        коллизионного права, и вы настоящим безоговорочно подчиняетесь
        неисключительной юрисдикции судов, находящихся в указанных ниже штате,
        провинции или стране, чье законодательство имеет приоритетное значение.
        <br />
        При этом из приложения к настоящему Соглашению исключается закон,
        известный как Конвенция Организации Объединенных Наций о международной
        купле-продаже товаров.
        <br />
        <strong>h.</strong> ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ ПОЛЬЗОВАНИЯ МАГАЗИНОМ ABOOK{" "}
        <br />
        Вы приобретаете Содержимое магазина ABook у третьего лица, поставляющего
        такое Содержимое (далее — «Издатель»), а не у компании NOVDA
        Edutainment. Компания NOVDA Edutainment выступает в качестве агента
        Издателя в предоставлении вам Содержимого магазина ABook. Следовательно,
        компания NOVDA Edutainment не является стороной сделки между вами и
        Издателем. Издатель Содержимого магазина ABook оставляет за собой право
        применять условия использования по отношению к такому Содержимому
        магазина ABook. Издатель Содержимого магазина ABook несет исключительную
        ответственность за содержание такого Содержимого, за выполнение любых
        гарантийных обязательств (при условии, что компания не заявила об отказе
        от таковых) и по любым претензиям, которые вы или другая сторона можете
        предъявить по отношению к такому Содержимому.
        <br />
        <strong>k.</strong> ПРОЧИЕ УСЛОВИЯ, ПРИМЕНИМЫЕ КО ВСЕМ УСЛУГАМ
        ОПРЕДЕЛЕНИЕ ПОНЯТИЯ NOVDA Edutainment
        <br />
        В зависимости от страны вашего проживания «NOVDA Edutainment»
        обозначает:
        <br />
        компанию NOVDA Edutainment Inc., находящуюся по адресу One NOVDA
        Edutainment Park Way, Cupertino, California, USA (США), — для
        пользователей в Северной, Центральной и Южной Америке (кроме Канады), а
        также на территориях и во владениях США, во французских и британских
        владениях в Северной Америке, Южной Америке и странах Карибского
        бассейна;
        <br />
      </p>
      <h2 className="agreement-title">ИЗМЕНЕНИЯ</h2>
      <p className="agreement-info">
        Компания NOVDA Edutainment оставляет за собой право в любое время
        изменять настоящее Соглашение, а также вводить новые или дополнительные
        условия использования вами Услуг. Такие изменения и дополнительные
        условия и положения будут вступать в силу немедленно и будут включены в
        настоящее Соглашение. Продолжение использования Услуг после этого будет
        означать ваше согласие с ними.
        <br />
      </p>
      <h2 className="agreement-title">МАТЕРИАЛЫ ТРЕТЬИХ ЛИЦ</h2>
      <p className="agreement-info">
        Компания NOVDA Edutainment не несет ответственности за материалы третьих
        лиц, включенные в Содержимое или Услуги, а также за предоставляемые
        ссылки на такие материалы. <br />
      </p>
      <h2 className="agreement-title">ИНТЕЛЛЕКТУАЛЬНАЯ СОБСТВЕННОСТЬ</h2>
      <p className="agreement-info">
        Вы соглашаетесь, что Услуги (в том числе, но не ограничиваясь этим,
        Содержимое, графические изображения, пользовательский интерфейс,
        аудиозаписи, видеозаписи, редакционное содержимое, скрипты и программное
        обеспечение, используемые для реализации Услуг) содержат
        конфиденциальную информацию и материалы, которые находятся в
        собственности компании NOVDA Edutainment и (или) ее лицензиаров и
        защищены применимыми законами в области интеллектуальной собственности и
        иными законами, включая, помимо прочего, законодательство об авторском
        праве. Вы соглашаетесь не использовать подобную конфиденциальную
        информацию или материалы каким-либо образом, за исключением
        использования Услуг в личных, некоммерческих целях в соответствии с
        настоящим Соглашением. <br />
      </p>
      <h2 className="agreement-title">УВЕДОМЛЕНИЕ ОБ АВТОРСКИХ ПРАВАХ</h2>
      <p className="agreement-info">
        Если вы полагаете, что какое-либо Содержимое, доступное в Услугах,
        нарушает заявленные вами авторские права, свяжитесь с компанией NOVDA
        Edutainment: <br />
      </p>
      <h3 className="agreement-subtitle">
        ПРЕКРАЩЕНИЕ И ПРИОСТАНОВЛЕНИЕ ДЕЙСТВИЯ УСЛУГ
      </h3>
      <p className="agreement-info">
        Если вы нарушите какое-либо из положений настоящего Соглашения или
        компания NOVDA Edutainment заподозрит вас в таком нарушении, она может
        без предварительного уведомления: (I) прекратить действие настоящего
        Соглашения и (или) вашего идентификатора ID, и вы будете нести
        ответственность за выплату всех сумм, причитающихся по вашему
        идентификатору ID вплоть до даты прекращения; и (или) (II) прекратить
        действие вашей лицензии на программное обеспечение; и (или) (III)
        закрыть вам доступ к Услугам. <br />
        <br />
        Компания NOVDA Edutainment оставляет за собой право в любое время
        изменять Услуги, приостанавливать или прекращать их предоставление (или
        какой-либо их части) как с предварительным уведомлением, так и без
        такового. При этом она не несет никакой ответственности перед вами или
        третьими лицами при осуществлении таких своих прав.
        <br />
      </p>
      <h2 className="agreement-title">
        ОТКАЗ ОТ ГАРАНТИЙ, ОГРАНИЧЕНИЕ ОТВЕТСТВЕННОСТИ
      </h2>
      <p className="agreement-info">
        КОМПАНИЯ NOVDA EDUTAINMENT НЕ ГАРАНТИРУЕТ, НЕ ЗАЯВЛЯЕТ И НЕ РУЧАЕТСЯ,
        ЧТО ИСПОЛЬЗОВАНИЕ ВАМИ УСЛУГ БУДЕТ НЕПРЕРЫВНЫМ И БЕЗ ОШИБОК. И ВЫ
        СОГЛАШАЕТЕСЬ, ЧТО КОМПАНИЯ NOVDA EDUTAINMENT МОЖЕТ ПРИОСТАНАВЛИВАТЬ
        ПРЕДОСТАВЛЕНИЕ УСЛУГ НА НЕОПРЕДЕЛЕННЫЙ СРОК, ПРЕКРАЩАТЬ ПРЕДОСТАВЛЕНИЕ
        УСЛУГ В ЛЮБОЕ ВРЕМЯ ИЛИ КАКИМ-ЛИБО ИНЫМ СПОСОБОМ ОГРАНИЧИВАТЬ ИЛИ
        БЛОКИРОВАТЬ ВАШ ДОСТУП К УСЛУГАМ, НЕ УВЕДОМЛЯЯ ВАС ОБ ЭТОМ.
        <br />
        ВЫ ПРЯМЫМ ОБРАЗОМ СОГЛАШАЕТЕСЬ, ЧТО ВАШЕ ПОЛЬЗОВАНИЕ УСЛУГАМИ ИЛИ ВАША
        НЕСПОСОБНОСТЬ ПОЛЬЗОВАТЬСЯ ИМИ ЯВЛЯЕТСЯ ИСКЛЮЧИТЕЛЬНО ВАШИМ РИСКОМ.
        УСЛУГИ И ВСЕ СОДЕРЖИМОЕ, ПРЕДОСТАВЛЯЕМОЕ ВАМ ПОСРЕДСТВОМ УСЛУГ (ЕСЛИ
        ИНОЕ ПРЯМО НЕ УКАЗАНО КОМПАНИЕЙ NOVDA EDUTAINMENT), ПРЕДОСТАВЛЯЮТСЯ ВАМ
        НА УСЛОВИЯХ «КАК ЕСТЬ» И «ПРИ НАЛИЧИИ» БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, ПРЯМЫХ И
        ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ ВСЕ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОГО
        СОСТОЯНИЯ, ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННЫХ ЦЕЛЕЙ, НАЛИЧИЯ ПРАВА
        СОБСТВЕННОСТИ И НЕНАРУШЕНИЯ ПРАВ ДРУГИХ ЛИЦ. ПОСКОЛЬКУ В НЕКОТОРЫХ
        ЮРИСДИКЦИЯХ НЕ ДОПУСКАЕТСЯ ИСКЛЮЧЕНИЕ ПОДРАЗУМЕВАЕМЫХ ГАРАНТИЙ,
        ПРЕДУСМОТРЕННОЕ ВЫШЕ ИСКЛЮЧЕНИЕ ПОДРАЗУМЕВАЕМЫХ ГАРАНТИЙ МОЖЕТ НЕ
        РАСПРОСТРАНЯТЬСЯ НА ВАС.
        <br />
        НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ КОМПАНИЯ NOVDA EDUTAINMENT, ЕЕ
        РУКОВОДИТЕЛИ, ДОЛЖНОСТНЫЕ ЛИЦА, СОТРУДНИКИ, АФФИЛИРОВАННЫЕ ЛИЦА, АГЕНТЫ,
        ПОДРЯДЧИКИ ИЛИ ЛИЦЕНЗИАРЫ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ЗА ПРЯМЫЕ, НЕПРЯМЫЕ,
        СЛУЧАЙНЫЕ, ШТРАФНЫЕ, ФАКТИЧЕСКИЕ ИЛИ КОСВЕННЫЕ УБЫТКИ, СВЯЗАННЫЕ С
        ИСПОЛЬЗОВАНИЕМ ВАМИ КАКИХ-ЛИБО УСЛУГ И (ИЛИ) СОДЕРЖИМОГО, А ТАКЖЕ ЗА
        ИНЫЕ ПРЕТЕНЗИИ, ТЕМ ИЛИ ИНЫМ ОБРАЗОМ СВЯЗАННЫЕ С ВАШИМ ПОЛЬЗОВАНИЕМ
        УСЛУГАМИ И (ИЛИ) СОДЕРЖИМЫМ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ЭТИМ, ОШИБКИ
        ИЛИ УПУЩЕНИЯ В ТОМ ИЛИ ИНОМ СОДЕРЖИМОМ, УБЫТКИ И УЩЕРБ ЛЮБОГО РОДА,
        ПОНЕСЕННЫЕ В РЕЗУЛЬТАТЕ ИСПОЛЬЗОВАНИЯ КАКОГО-ЛИБО СОДЕРЖИМОГО,
        РАЗМЕЩЕННОГО, ПЕРЕДАННОГО ИЛИ ПРЕДОСТАВЛЕННОГО КАКИМ-ЛИБО ИНЫМ СПОСОБОМ
        ПОСРЕДСТВОМ УСЛУГ, ДАЖЕ ЕСЛИ БЫЛО СДЕЛАНО ПРЕДУПРЕЖДЕНИЕ О ВОЗМОЖНОСТИ
        ИХ ВОЗНИКНОВЕНИЯ. ПОСКОЛЬКУ В НЕКОТОРЫХ СТРАНАХ, ГОСУДАРСТВАХ ИЛИ
        ЮРИСДИКЦИЯХ НЕ ДОПУСКАЕТСЯ ИСКЛЮЧЕНИЕ ИЛИ ОГРАНИЧЕНИЕ ОТВЕТСТВЕННОСТИ ЗА
        КОСВЕННЫЕ ИЛИ СЛУЧАЙНЫЕ УБЫТКИ, В ТАКИХ СТРАНАХ, ГОСУДАРСТВАХ ИЛИ
        ЮРИСДИКЦИЯХ ОТВЕТСТВЕННОСТЬ КОМПАНИИ NOVDA EDUTAINMENT ОГРАНИЧИВАЕТСЯ В
        ТЕХ ПРЕДЕЛАХ, В КАКИХ ЭТО ДОПУСКАЕТСЯ ЗАКОНОМ.
        <br />
        КОМПАНИЯ NOVDA EDUTAINMENT ПРИЛОЖИТ ВСЕ РАЗУМНЫЕ УСИЛИЯ ДЛЯ ЗАЩИТЫ
        ИНФОРМАЦИИ, ПРЕДОСТАВЛЕННОЙ ВАМИ В СВЯЗИ С УСЛУГАМИ. ПРИ ЭТОМ ВЫ
        СОГЛАШАЕТЕСЬ, ЧТО ПРЕДОСТАВЛЕНИЕ ВАМИ ТАКОЙ ИНФОРМАЦИИ ЯВЛЯЕТСЯ
        ИСКЛЮЧИТЕЛЬНО ВАШИМ РИСКОМ, И ВЫ НАСТОЯЩИМ СНИМАЕТЕ С КОМПАНИИ NOVDA
        EDUTAINMENT ВСЮ ОТВЕТСТВЕННОСТЬ ПЕРЕД ВАМИ ЗА ВСЕ УБЫТКИ ИЛИ
        ОБЯЗАТЕЛЬСТВА, КАКИМ-ЛИБО ОБРАЗОМ СВЯЗАННЫЕ С ТАКОЙ ИНФОРМАЦИЕЙ.
        <br />
        КОМПАНИЯ NOVDA EDUTAINMENT НЕ ЗАЯВЛЯЕТ И НЕ ГАРАНТИРУЕТ, ЧТО В ХОДЕ
        ПРЕДОСТАВЛЕНИЯ УСЛУГ НЕ ВОЗНИКНУТ ПОТЕРИ, ПОВРЕЖДЕНИЯ ДАННЫХ, АТАКИ,
        ВОЗДЕЙСТВИЯ ВИРУСОВ, ВМЕШАТЕЛЬСТВО, ВЗЛОМ ИЛИ ИНЫЕ НАРУШЕНИЯ СИСТЕМЫ
        БЕЗОПАСНОСТИ. И ВЫ НАСТОЯЩИМ СНИМАЕТЕ С КОМПАНИИ NOVDA EDUTAINMENT ВСЮ
        ОТВЕТСТВЕННОСТЬ ЗА ПЕРЕЧИСЛЕННОЕ ВЫШЕ. ВЫ НЕСЕТЕ ОТВЕТСТВЕННОСТЬ ЗА
        СОЗДАНИЕ РЕЗЕРВНЫХ КОПИЙ ИНФОРМАЦИИ, СОДЕРЖАЩЕЙСЯ В ВАШЕЙ СИСТЕМЕ,
        ВКЛЮЧАЯ ВСЕ СОДЕРЖИМОЕ, ПРИОБРЕТЕННОЕ ИЛИ АРЕНДОВАННОЕ ПОСРЕДСТВОМ
        УСЛУГ.
        <br />
        КОМПАНИЯ NOVDA EDUTAINMENT НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ЗА ОПЛАТУ ПЕРЕДАЧИ
        ДАННЫХ, КОТОРУЮ МОГУТ СНЯТЬ С ВАС В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ УСЛУГ. <br />
      </p>
      <h3 className="agreement-subtitle">
        ОТКАЗ ОТ ПРАВА ТРЕБОВАНИЯ И ГАРАНТИЯ ВОЗМЕЩЕНИЯ УЩЕРБА
      </h3>
      <p className="agreement-info">
        В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ УСЛУГ ВЫ ГАРАНТИРУЕТЕ (В ПРЕДЕЛАХ, РАЗРЕШЕННЫХ
        ЗАКОНОМ) ВОЗМЕЩЕНИЕ УБЫТКОВ КОМПАНИИ NOVDA EDUTAINMENT, ЕЕ
        РУКОВОДИТЕЛЯМ, ДОЛЖНОСТНЫМ ЛИЦАМ, СОТРУДНИКАМ, АФФИЛИРОВАННЫМ ЛИЦАМ,
        АГЕНТАМ, ПОДРЯДЧИКАМ И ЛИЦЕНЗИАРАМ И ПРИНИМАЕТЕ НА СЕБЯ ВСЮ ИХ
        ОТВЕТСТВЕННОСТЬ В СВЯЗИ С ЛЮБЫМИ ТРЕБОВАНИЯМИ ПО ПРИЧИНЕ НАРУШЕНИЯ ВАМИ
        УСЛОВИЙ НАСТОЯЩЕГО СОГЛАШЕНИЯ, ИСПОЛЬЗОВАНИЕМ ВАМИ УСЛУГ, А ТАКЖЕ ПО
        ПРИЧИНЕ ДЕЙСТВИЙ КОМПАНИИ NOVDA EDUTAINMENT В РАМКАХ РАССЛЕДОВАНИЯ
        ПРЕДПОЛАГАЕМОГО НАРУШЕНИЯ НАСТОЯЩЕГО СОГЛАШЕНИЯ ИЛИ В РЕЗУЛЬТАТЕ ЕЕ
        ЗАКЛЮЧЕНИЯ ИЛИ РЕШЕНИЯ, ЧТО НАРУШЕНИЕ НАСТОЯЩЕГО СОГЛАШЕНИЯ ИМЕЛО МЕСТО.
        ВЫ СОГЛАШАЕТЕСЬ НЕ ПРЕДЪЯВЛЯТЬ СУДЕБНЫЕ ИСКИ К КОМПАНИИ NOVDA
        EDUTAINMENT, ЕЕ РУКОВОДИТЕЛЯМ, ДОЛЖНОСТНЫМ ЛИЦАМ, СОТРУДНИКАМ,
        АФФИЛИРОВАННЫМ ЛИЦАМ, АГЕНТАМ, ПОДРЯДЧИКАМ И ЛИЦЕНЗИАРАМ И НЕ ВЗЫСКИВАТЬ
        С НИХ УЩЕРБ В РЕЗУЛЬТАТЕ РЕШЕНИЯ КОМПАНИИ NOVDA EDUTAINMENT ОБ ИЗЪЯТИИ
        ИЛИ ОТКАЗЕ В ОБРАБОТКЕ КАКОЙ-ЛИБО ИНФОРМАЦИИ ИЛИ КАКОГО-ЛИБО
        СОДЕРЖИМОГО, РЕШЕНИЯ О ПРЕДУПРЕЖДЕНИИ ВАС, О ПРИОСТАНОВЛЕНИИ ИЛИ
        ПРЕКРАЩЕНИИ ВАШЕГО ДОСТУПА К УСЛУГАМ ЛИБО ОБ ОСУЩЕСТВЛЕНИИ ИНЫХ ДЕЙСТВИЙ
        В ПРОЦЕССЕ РАССЛЕДОВАНИЯ ПРЕДПОЛАГАЕМОГО НАРУШЕНИЯ ИЛИ В РЕЗУЛЬТАТЕ
        ЗАКЛЮЧЕНИЯ КОМПАНИИ NOVDA EDUTAINMENT О ТОМ, ЧТО НАРУШЕНИЕ НАСТОЯЩЕГО
        СОГЛАШЕНИЯ ИМЕЛО МЕСТО. НАСТОЯЩИЙ ОТКАЗ ОТ ПРАВА ТРЕБОВАНИЯ И ГАРАНТИЯ
        ВОЗМЕЩЕНИЯ УЩЕРБА ПРИМЕНЯЮТСЯ КО ВСЕМ НАРУШЕНИЯМ, ОГОВОРЕННЫМ ИЛИ
        ПРЕДУСМОТРЕННЫМ НАСТОЯЩИМ СОГЛАШЕНИЕМ.
        <br />
        <br />
      </p>
      <h2 className="agreement-title">
        ИСКЛЮЧЕНИЯ, УСТАНОВЛЕННЫЕ ЗАКОНОМ ДЛЯ ГОСУДАРСТВЕННЫХ УЧРЕЖДЕНИЙ
      </h2>
      <p className="agreement-info">
        Если вы являетесь юридически правомочным государственным учебным
        заведением или правительственным учреждением и какая-либо часть
        настоящего Соглашения (например, раздел о возмещении убытков или
        какая-либо его часть) является недействительной или неисполнимой по
        отношению к вам согласно применимому местному, национальному,
        государственному или федеральному законодательству, то эта часть, в
        зависимости от обстоятельств, будет считаться недействительной или
        неисполнимой и будет истолкована в том порядке, который в максимальной
        степени соответствует применимому регулирующему законодательству. <br />
      </p>
      <h2 className="agreement-title">РЕГУЛИРУЮЩЕЕ ЗАКОНОДАТЕЛЬСТВО</h2>
      <p className="agreement-info">
        Кроме случаев, прямо оговоренных в следующем абзаце, настоящее
        Соглашение и отношения между вами и компанией NOVDA Edutainment, а также
        все Сделки, связанные с Услугами, должны регулироваться законами
        Республики Узбекистан за исключением его положений коллизионного права.
        Вы и компания NOVDA Edutainment соглашаетесь подчиняться персональной и
        исключительной юрисдикции судов, находящихся на территории Республики
        Узбекистан, для разрешения каких-либо споров или претензий, вытекающих
        из настоящего Соглашения. Если вы (a) не являетесь гражданином
        Республики Узбекистан, (b) не проживаете в Республики Узбекистан, (c) не
        осуществляете доступ к Услуге из Республики Узбекистан и (d) являетесь
        гражданином одной из стран, указанных ниже, вы тем самым соглашаетесь,
        что любой спор или претензия, вытекающие из настоящего Соглашения,
        регулируются действующим законодательством, изложенным ниже, без учета
        каких-либо положений коллизионного права, и вы настоящим безоговорочно
        подчиняетесь неисключительной юрисдикции судов, находящихся в указанных
        ниже штате, провинции или стране, чье законодательство имеет
        приоритетное значение.
        <br />
        <br />
        При этом из приложения к настоящему Соглашению исключается закон,
        известный как Конвенция Организации Объединенных Наций о международной
        купле-продаже товаров.
        <br />
      </p>
      <h2 className="agreement-title">ПРОЧИЕ УСЛОВИЯ</h2>
      <p className="agreement-info">
        Настоящее Соглашение представляет собой полный объем договоренностей
        между вами и компанией NOVDA Edutainment и регулирует использование вами
        Услуг, заменяя собой все предшествующие договоренности между вами и
        компанией NOVDA Edutainment относительно того же самого предмета
        договора. На вас также могут распространяться дополнительные положения и
        условия, применяющиеся при использовании вами услуг аффилированных лиц,
        Содержимого третьих лиц, программного обеспечения третьих лиц или
        дополнительных услуг, таких как Программа оптовой закупки (VPP). Если та
        или иная часть настоящего Соглашения будет признана недействительной или
        неисполнимой, она будет истолкована в соответствии с применимым
        законодательством так, чтобы в максимальной степени отразить
        первоначальные намерения сторон, а остальные части полностью останутся в
        силе. Не приведение компанией NOVDA Edutainment в исполнение того или
        иного права или положения настоящего Соглашения не означает ее отказа от
        права требовать исполнения подобного положения, а также всех остальных
        положений. Компания NOVDA Edutainment не несет ответственности за
        неисполнение тех или иных обязательств по не зависящим от нее причинам.
        <br />
        Вы соглашаетесь соблюдать требования всех местных, государственных,
        федеральных и национальных законов, законодательных актов, постановлений
        и нормативных документов, применимых к использованию вами Услуг.
        Использование вами Услуг также может регулироваться другими законами.
        Риск утраты в отношении всех сделок, совершенных в электронной форме,
        переходит к покупателю после передачи данных в электронном виде
        получателю. Никакой сотрудник или агент компании NOVDA Edutainment не
        обладает полномочиями изменять настоящее Соглашение.
        <br />
        Компания NOVDA Edutainment может отправлять вам уведомления в связи с
        Услугами по электронной или обычной почте либо размещать объявления в
        Услугах. Уведомления вступают в силу незамедлительно. Компания NOVDA
        Edutainment может также отправлять вам дополнительную информацию об
        Услугах по электронной почте или посредством push-сообщений. <br />
        Настоящим вы предоставляете компании NOVDA Edutainment право совершать
        действия, которые она считает разумно необходимыми или целесообразными
        для обеспечения выполнения и (или) проверки соблюдения какой-либо части
        настоящего Соглашения. Вы соглашаетесь, что компания NOVDA Edutainment
        имеет право, не неся ответственности перед вами, раскрывать любые данные
        и (или) информацию правоохранительным органам, государственным служащим
        и (или) третьим лицам, если сочтет это разумно необходимым или
        надлежащим для обеспечения выполнения и (или) проверки соблюдения
        какой-либо части настоящего Соглашения (в том числе, но не ограничиваясь
        этим, компания NOVDA Edutainment имеет право оказывать содействие в ходе
        любого судебного процесса в связи с использованием вами Услуг и (или)
        Содержимого и (или) в связи с требованиями третьих лиц на основании
        того, что использование вами Услуг и (или) Содержимого является
        незаконным и (или) нарушает их права).
        <br />
        Детям, не достигшим совершеннолетия, следует ознакомиться с настоящим
        Соглашением вместе со своим родителем или официальным опекуном, чтобы
        обеспечить понимание ребенком и его родителем (опекуном) условий
        настоящего Соглашения.
        <br />
      </p>
      <h3 className="agreement-subtitle">
        Дата последнего обновления: 13 мая 2019 г.
      </h3>
    </div>
  );
};

export default AgreementText;
